#define _CRT_SECURE_NO_WARNINGS 1;
#include<stdio.h>
int main()
{
	int a=3;//a的补码为00000000000000000000000000000011	
	int b = 3;// b的补码为00000000000000000000000000000011	
	a = a >> 1;//a右移1为000000000000000000000000000000001			   
	b = b << 1;//b左移1为000000000000000000000000000000110
	printf("%d\n", a);//移位运算分为算术移位和逻辑移位，算术移位符号位补符号位，后面补0;逻辑移位符号位始终补0，后面也补0
	printf("%d\n", b);
	return 0;
	//原码100000000000000000000000000000001
	//反码111111111111111111111111111111110
	//补码111111111111111111111111111111111
	//内存是补码，原码显示

}